app/Controllers/Roles.php

SELECT *
FROM `roles`
---
    public function index()
    {
        $rolesModel = new RolesModel();
        $countryModel = new CountryModel();

        $info["roles"]=$rolesModel->findAll();